#	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
#	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
#	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
#	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка

# Годишната такса за тренировки по баскетбол – цяло число в интервала

# Напишете програма, която изчислява какви разходи ще има Джеси,
# ако започне да тренира, като знаете колко е таксата за тренировки по баскетбол за период от 1 година.

# Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.

annual_tax = int(input())

# 100% - 40% = 60% ->0.6
# 100% - 20% = 80% -> 0.8
# 1/5 -> / 5 (deleno na 5)
# 1/4 -> / 4 (deleno na 4)

sneakers_price = annual_tax - annual_tax * 40 / 100 # * 0.4 => annual_tax * 0.60
clothing_price = sneakers_price * 0.8
ball_price = clothing_price / 4
accessories_price = ball_price / 5

total_price = annual_tax + sneakers_price + clothing_price + ball_price + accessories_price

print(total_price)



