# Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3
#За да превърнете от кубични сантиметри (см³) в кубични дециметри (дм³), използвате връзката между двете мерни единици:
# 1 дм³ = 1000 см³
# 1 дм³=1000 см³
# Така че, за да превърнете 1 см³ в дм³, използвате следната пропорция:
# 1 см³ =0.001 дм³
# 1 см³=0.001 дм³
# Тоест, 1 кубичен сантиметър е равен на 0.001 кубични дециметра.
# => Обяснението идва от това как се отнасят дециметрите към сантиметрите и обратно:
# Един дециметър (дм) е равен на 10 сантиметра (см).
#
# За да определим обема в кубични мерни единици, трябва да вдигнем дължината на трета степен
# (т.е. да я умножим по себе си три пъти).
#
# Ако вземем един кубичен дециметър (1 дм х 1 дм х 1 дм), той е равен на:
# \[ (10 см) х (10 см) х (10 см) = 1000 \text{ см³} \]
#
# Така че, 1 дм³ е равен на 1000 см³.
#
# Обаче, ако искаме да намерим колко дм³ са в 1 см³, трябва да разделим 1 на 1000 (защото една хиляда см³ са в един дм³):
# \[ 1 \text{ см³} = \frac{1}{1000} \text{ дм³} = 0.001 \text{ дм³} \]
#
# Това е как получаваме стойността 0.001 дм³ за 1 см³.



# Формула за намиране на обем на Паралелепипед V = a.b.c
# Формула за намиране на лице на Паралелепипед S = 2.(a.b+a.c+b.c)

#	Дължина в см – цяло число в интервала [10 … 500]
#	Широчина в см – цяло число в интервала [10 … 300]
#	Височина в см – цяло число в интервала [10… 200]
#	Процент  – реално число в интервала [0.000 … 100.000]

# Да се отпечата на конзолата едно число: литрите вода, които ще  събира аквариума.

length = int(input())
width = int(input())
heights = int(input())
percent_non_free_volume = float(input())

fish_tank_volume = length * width * heights
fish_tank_volume_in_liter = fish_tank_volume / 1000 # 0.001 desetichno chislo
percentage = percent_non_free_volume / 100 # * 0.01
needed_liters = fish_tank_volume_in_liter * (1 - percentage)

print(needed_liters)

