# Да се напише конзолна програма,
# която чете оценка (реално число) float,
# въведена от потребителя и отпечатва "Excellent!", ако оценката е 5.50 или по-висока.


# Създайте една променлива, в която да запазите реално число
# – оценката, което ще прочетете от конзолата:

first_number = int(input())
second_number = int(input())

# 2.	Направете проверка за стойността на оценката.
# Ако тя е по-голяма или равна на 5.50 отпечатайте изхода по условие:

if first_number > second_number:
    print(first_number)
else:
    print(second_number)