# •	Цената за наем на кораба през пролетта е  3000 лв.;
# •	Цената за наем на кораба през лятото и есента е  4200 лв.;
# •	Цената за наем на кораба през зимата е  2600 лв.

# •	Ако групата е до 6 човека включително  -  отстъпка от 10%;
# •	Ако групата е от 7 до 11 човека включително  -  отстъпка от 15%;
# •	Ако групата е от 12 нагоре  -  отстъпка от 25%.

# Рибарите ползват допълнително 5% отстъпка,
# ако са четен брой, освен ако не е есен - тогава нямат допълнителна отстъпка,
# която се начислява след като се приспадне отстъпката по горните критерии.
# Напишете програма, която да пресмята дали рибарите ще съберат достатъчно пари.

# Вход
# •	Бюджет на групата - цяло число;
# •	Сезон -  текст: "Spring", "Summer", "Autumn" или "Winter";
# •	Брой рибари - цяло число.

# Съвет Иван Шопов. Винаги се старайте да пишете блок код
# по този начин, като използвате една променлива


budget = int(input())
season = input()
number_of_fishermans = int(input())

boat_rent = 0
if season == "Spring":
    boat_rent = 3000
elif season == "Summer" or season == "Autumn": # да се изписва винаги променливата с нещо си, или променливата равно нещо си.
    boat_rent = 4200
elif season == "Winter":
    boat_rent = 2600

if number_of_fishermans <= 6:
    boat_rent *= 0.9 # това е отстъпката от 10%
elif number_of_fishermans <= 11:
    boat_rent *= 0.85 # това е отстъпката от 15%
else: #number_of_fishermans >= 12
    boat_rent *= 0.75

# четен брой с правилото % 2 == 0
if number_of_fishermans % 2 == 0 and season != "Autumn": # трябва и от двете страни условията да са ни True
    boat_rent *= 0.95

# Правим си една променлива, която ще е абсолютната стойност с abs() difference {останалите пари}
difference = abs(boat_rent - budget)
if budget >= boat_rent:
    print(f"Yes! You have {difference:.2f} leva left.")
else:
    print(f"Not enough money! You need {difference:.2f} leva.")





