# Напишете програма, която прочита време на изпит и време
# на пристигане и отпечатва дали студентът е дошъл навреме,
# дали е подранил или е закъснял и с колко часа или минути е подранил или закъснял.

# Вход
# От конзолата се четат 4 цели числа (по едно на ред), въведени от потребителя:
# •	Първият ред съдържа час на изпита - цяло число от 0 до 23;
# •	Вторият ред съдържа минута на изпита - цяло число от 0 до 59;
# •	Третият ред съдържа час на пристигане - цяло число от 0 до 23;
# •	Четвъртият ред съдържа минута на пристигане - цяло число от 0 до 59.

# Изход
# На първия ред отпечатайте:
# •	"Late", ако студентът пристига по-късно от часа на изпита;
# •	"On time", ако студентът пристига точно в часа на изпита или до 30 минути по-рано;
# •	"Early", ако студентът пристига повече от 30 минути преди часа на изпита.

# Ако студентът пристига с поне минута разлика от часа на изпита, отпечатайте на следващия ред:
# •	"mm minutes before the start" за идване по-рано с по-малко от час;
# •	"hh:mm hours before the start" за подраняване с 1 час или повече. Минутите винаги печатайте с 2 цифри,
# например "1:05”;
# •	 "mm minutes after the start" за закъснение под час;
# •	"hh:mm hours after the start" за закъснение от 1 час или повече. Минутите винаги печатайте с 2 цифри,
# например "1:03”.

# Когато не сме сигурни, какво точно трябва да направим - тогава Придържайте се към последователсността на условието.
# За това почнете да си разписвате структурата на проверката, с това, което е написано по условие
# За улеснение, да се обърнат всички мерни единици в минути.

exam_hour = int(input())
exam_min = int(input())
arrival_hour = int(input())
arrival_min = int(input())

# Late:
# 9:30 е изпита, а той пристига в 9:50
# 9 * 60 + 30 = 570 та минута изпита. И сътветно 9 * 60 + 50 = 590та минута пристига
# Така ще ни е по-ясно за имплетентацията на проверката
# if 570 < 590

# On time:
# 9:00 -> 8:30
# 540 -> 510 540 - 510 = 30

# Early:
#

exam_all_min = (exam_hour * 60) + exam_min
arrival_all_min = (arrival_hour * 60) + arrival_min
diff_min = abs(arrival_all_min - exam_all_min)

if arrival_all_min > exam_all_min:
    print("Late")
    if diff_min >= 60:
        hour = diff_min // 60
        minutes = diff_min % 60
        print(f"{hour}:{minutes:02d} hours after the start")
    else:
        print(f"{diff_min} minutes after the start")
elif arrival_all_min == exam_all_min or diff_min <= 30:
    print("On time")
    if diff_min > 0:
        print(f"{diff_min} minutes before the start")
else:
    print("Early")
    if diff_min >= 60:
        hour = diff_min // 60
        minutes = diff_min % 60
        print(f"{hour}:{minutes:02d} hours before the start")
    else:
        print(f"{diff_min} minutes before the start")























